Repository: kingrpaul/eo-glossary
Catalog: tm/the-hanging-stranger_en_eo.tmx
Source language: en
Languages: eo

source: Beyond the police station was the City Hall, the old-fashioned yellow structure of wood and gilded brass and broad cement steps.
eo: Preter la policejo estis la urbodomo, la malmoderna flava edificio de ligno kaj orita latuno kaj granda cementa ŝtupoj.

source: He could see the endless rows of offices, dark windows, the cedars and beds of flowers on each side of the entrance.
eo: Li povis vidi la senfina vicoj da oficejoj, malhela fenestroj, la cedroj kaj bedo de floroj ĉe ĉiu flanko de la enirejo.

source: And⁠—something else.
eo: Kaj⁠—io alia.

source: Above the City Hall was a patch of darkness, a cone of gloom denser than the surrounding night.
eo: Super de la urbodomo estis regioneto da mallumo, konuso de morno pli densa ol la cirkaŭa nokta.

source: A prism of black that spread out and was lost into the sky.
eo: Prismo el nigro tio disvastiĝas kaj estis perdinta en la cielo.

source: He listened.
eo: Li aŭskultis.

source: Good God, he could hear something.
eo: Bona Dio, li povis aŭdi ion.

source: Something that made him struggle frantically to close his ears, his mind, to shut out the sound.
eo: Io kio devis lin lukti freneze fermi siajn orelojn, sian menson, elbari la sonon.

source: A buzzing.
eo: Zumado.

source: A distant, muted hum like a great swarm of bees.
eo: Malproksima, mallaŭta zumo kiel granda svarmo da abeloj.

source: Loyce gazed up, rigid with horror.
eo: Lojso rigardis supren, rigida pro hororo.

source: The splotch of darkness, hanging over the City Hall.
eo: La makulo el mallumo, pendanta super la urbodomo.

source: Darkness so thick it seemed almost solid.
eo: Mallumo tiel dika ke ĝi ŝajnis preskaŭ solida.

source: In the vortex something moved. Flickering shapes.
eo: En la vortico io movis. Flagrantaj formoj.

source: Things, descending from the sky, pausing momentarily above the City Hall, fluttering over it in a dense swarm and then dropping silently onto the roof.
eo: Aferaĉoj descendis el la ĉielo, paŭzis momente super la urbodomo, flirtis super ĝi en densa svarmo kaj poste silente falis al la tegmenton.

source: Shapes.
eo: Formoj.

source: Fluttering shapes from the sky.
eo: Flirtantaj formoj el la ĉielo.

source: From the crack of darkness that hung above him.
eo: El la fendo de mallumo, kiu pendis super ili.

source: He was seeing⁠—them.
eo: Li estis vidanta⁠—ilin.

source: For a long time Loyce watched, crouched behind a sagging fence in a pool of scummy water.
eo: Longtempe Lojso rigardis, kaŭre malantaŭ malviglanta barilo en flako da ŝaŭma skoria akvo.

source: They were landing.
eo: Ili estis alteriĝantaj.

source: Coming down in groups, landing on the roof of the City Hall and disappearing inside.
eo: Malsuprenantaj en grupoj, alteriĝantaj sur la tegmento de la urbodomo kaj malaperiĝantaj interne.

source: They had wings.
eo: Ili havis flugilojn.

source: Like giant insects of some kind.
eo: Kiel ia grandegaj insektoj.

source: They flew and fluttered and came to rest⁠—and then crawled crab-fashion, sideways, across the roof and into the building.
eo: Ili flugis kaj flirtis kaj ekripozis⁠—kaj poste rampis kiel kraboj, flanken, trans la tegmenton kaj en la konstruaĵon.

source: He was sickened.
eo: Li estis ekmalsaniĝa.

source: And fascinated.
eo: Kaj fascinita.

source: Cold night wind blew around him and he shuddered.
eo: Malvarme nokta vento blovis cirkaŭ lin kaj li ektremis.

source: He was tired, dazed with shock.
eo: Li estis laca, stuporita per ŝoko.

source: On the front steps of the City Hall were men, standing here and there.
eo: Sur la antaŭŝtupoj de la urbodomo estis viroj, starantaj ĉi tie kaj tie.

source: Groups of men coming out of the building and halting for a moment before going on.
eo: Grupoj da viro elvenanta el la konstruaĵo kaj haltanta dum momento antau ili eniri.

source: Were there more of them?
eo: Estis pli da ili?

source: It didn’t seem possible.
eo: Ne ŝaĵnis ebla.

source: What he saw descending from the black chasm weren’t men.
eo: Kio li vidis malsupreniri de la nigra abismo ne estis viroj.

source: They were alien⁠—from some other world, some other dimension.
eo: Ili estis eksterteranaj⁠—el iu alia mondo, iu alia dimensio.

source: Sliding through this slit, this break in the shell of the universe.
eo: Glitantaj tra ĉi tiu fendeto, ĉi tiu rompaĵo en la ŝelo de la universo.

source: Entering through this gap, winged insects from another realm of being.
eo: Enirantaj tra ĉi tiu breĉo, flugilaj insektoj el alia regno de esti.

source: On the steps of the City Hall a group of men broke up.
eo: Sur la ŝtupoj de la urbodomo grupo da viroj disiĝis.

source: A few moved toward a waiting car.
eo: Kelkaj moviĝis al atendanta aŭto.

source: One of the remaining shapes started to re-enter the City Hall.
eo: Unu de la ceteraj formoj komencis reeniri la urbodomo.

source: It changed its mind and turned to follow the others.
eo: Ĝi ŝanĝiĝis ĝian opinion kaj turniĝis por sekvi la aliajn.

source: Loyce closed his eyes in horror.
eo: Lojso fermis siajn okojojn pro hororo.

source: His senses reeled.
eo: Lian sentoj ŝanceliĝis.

source: He hung on tight, clutching at the sagging fence.
eo: Li tenadis streĉe, kroĉanta al la malvigliĝanta barilo.

source: The shape, the man-shape, had abruptly fluttered up and flapped after the others.
eo: La formo, la homa formo, abrupte flirtis supren kaj flugfrapis por sekvi la aliajn.

source: It flew to the sidewalk and came to rest among them.
eo: Ĝi flugis al la trotuaro kaj iĝi ripoza inter ilin.

source: Pseudo-men.
eo: Pseŭda viroj.

source: Imitation men.
eo: Imita viroj.

source: Insects with ability to disguise themselves as men.
eo: Insektoj kun la kapablo alivesti sin kiel viroj.

source: Like other insects familiar to Earth. Protective coloration.
eo: Lojso tiris sin mem for.

source: Mimicry. Loyce pulled himself away.
eo: Li atingis malrapide lian piedojn.

source: He got slowly to his feet.
eo: Estis nokto.

source: It was night. The alley was totally dark.
eo: La strateto estis tute malhela.

source: But maybe they could see in the dark.
eo: Sed eble ili povis vidi en la malhelo.

source: Maybe darkness made no difference to them.
eo: Eble malhelo ne limigis ilin.

source: He left the alley cautiously and moved out onto the street.
eo: Li eliris la strateton zorge kaj moviĝis eksteren sur la strato.

source: Men and women flowed past, but not so many, now.
eo: Viroj kaj virinoj fluis preter, sed ne tiom multa, nun.

source: At the bus-stops stood waiting groups.
eo: Ĉe la busaj haltejoj staris antendantaj grupoj.

source: A huge bus lumbered along the street, its lights flashing in the evening gloom.
eo: Grandega buso movis pese laŭ la strato, ĝia lumoj ekbrilis en la vespera morno.

source: Loyce moved forward.
eo: Lojso moviĝis antaŭe.

source: He pushed his way among those waiting and when the bus halted he boarded it and took a seat in the rear, by the door.
eo: Li puŝis sin inter ili atendanta kaj kiam la buso haltis li enriris ĝin kaj tenis sidejon en la malantaŭo, apud la pordo.

source: A moment later the bus moved into life and rumbled down the street.
eo: Post momento la buso moviĝis en vivo kaj bruis laŭ la strato.

source: Loyce relaxed a little.
eo: Lojso trankviliĝis iomete.

source: He studied the people around him.
eo: Li studis la homojn cirkaŭ li.

source: Dulled, tired faces.
eo: Obtuzintaj, lacaj vizajoj.

source: People going home from work.
eo: Homoj iranta hejmen el laborejo.

source: Quite ordinary faces.
eo: Tute ordinara vizajoj.

source: None of them paid any attention to him.
eo: Neniu da ilin donis iom atenton al li.

source: All sat quietly, sunk down in their seats, jiggling with the motion of the bus.
eo: Ĉiuj sidis trankvile, malviglĝante malsupre en ilia sidejo, skuanta per la movado de la buso.

source: The man sitting next to him unfolded a newspaper.
eo: La viro sidanta apud lin malfaldis jurnalon.

source: He began to read the sports section, his lips moving.
eo: Li komencis legi la sportajn sekcion, lia lipoj movantaj.

source: An ordinary man.
eo: Ordinara viro.

source: Blue suit.
eo: Blua kompleto.

source: Tie.
eo: Kravato.

source: A businessman, or a salesman.
eo: Komercisto, aŭ vendisto.

source: On his way home to his wife and family.
eo: Survoje hejmen al lia edzino kaj familio.

source: Across the aisle a young woman, perhaps twenty.
eo: Trans la koridoro juna virino, eble dudeka.

source: Dark eyes and hair, a package on her lap.
eo: Malhela okuloj kaj hararoj, pakaĝo sur ŝia genuo.

source: Nylons and heels.
eo: Nilonoj kaj kalkanoj.

source: Red coat and white angora sweater.
eo: Ruĝa mantelo kaj blanka mohajra svetero.

source: Gazing absently ahead of her.
eo: Rigardanta vake anataŭen ŝi.

source: A high school boy in jeans and black jacket.
eo: Knabo del mezlernejo surhavanta ĝinzon kaj nigran jako.

source: A great triple-chinned woman with an immense shopping bag loaded with packages and parcels.
eo: Granda triobla-mentona virino kun grandega aĉeta sako plena per pakaĵoj kaj faskoj.

source: Her thick face dim with weariness.
eo: Ŝia dika vizago malheleta per laceco.

source: Ordinary people.
eo: Ordinaraj homoj.

source: The kind that rode the bus every evening.
eo: Tiaj, kiuj rajdis la buson ĉiu vespere.

source: Going home to their families.
eo: Iri hejmen al liaj familioj.

source: To dinner.
eo: Al vespermanĝo.

source: Going home⁠—with their minds dead.
eo: Iranta hejmen⁠—kun iliaj mensoj mortitaj.

source: Controlled, filmed over with the mask of an alien being that had appeared and taken possession of them, their town, their lives.
eo: Kontrolitaj, kovrita de filmaĵo per la masko de eksterterana estaĵo kiu aperis kaj surprenis ilin, ilia urbeto, iliaj vivoj.

source: Himself, too.
eo: Li mem, ankaŭ.

source: Except that he happened to be deep in his cellar instead of in the store.
eo: Krom ke li hazarde estis profunde en sia kelo anstataŭ en la butiko.

source: Somehow, he had been overlooked.
eo: Iel, li estis preter'atentita.

source: They had missed him.
eo: Ili maltrafis lin.

source: Their control wasn’t perfect, foolproof.
eo: Ilia kontrolo ne estis perfekta, malsaĝ'imuna.

source: Maybe there were others.
eo: Eble estis aliaj.

source: Hope flickered in Loyce.
eo: Espero flagris en Lojso.

source: They weren’t omnipotent.
eo: Ili ne estis ĉiopova.

source: They had made a mistake, not got control of him.
eo: Ili estis farinta eraron, ne akiris kontrolo super li.

source: Their net, their field of control, had passed over him.
eo: Ilia reto, ilia loko de kontrolo, estis pasinta super lin.

source: He had emerged from his cellar as he had gone down.
eo: Li estis aperinta del sia kelo kiel li estis malsuprinta.

source: Apparently their power-zone was limited.
eo: Verŝajne ilia zono de potenco estis limigita.

source: A few seats down the aisle a man was watching him.
eo: Kelkaj sidejoj laŭ la koridoro viro estis rigardanta lin.

source: Loyce broke off his chain of thought.
eo: Lojso ek'ĉesis lian ĉenon de penso.

source: A slender man, with dark hair and a small mustache.
eo: Maldika viro, kun malhela haraoj kaj malgranda liphararoj.

source: Well-dressed, brown suit and shiny shoes.
eo: Bona vestita, bruna kompleto kaj brilaj suoj.

source: A book between his small hands.
eo: Libro inter lia malgranda manoj.

source: He was watching Loyce, studying him intently.
eo: Li estis rigardanta Lojson, studanta lin intense.

source: He turned quickly away.
eo: Li el turniĝis for rapide.

source: Loyce tensed.
eo: Lojso ek'maltrankvil'iĝis.

source: One of them?
eo: Unu el ili?

source: Or⁠—another they had missed?
eo: Aŭ⁠—alia iu ili maltrafis?

source: The man was watching him again.
eo: La viro estis rigardanta lin denove.

source: Small dark eyes, alive and clever.
eo: Malgrandaj malhelaj okuloj, viva kaj lerta.

source: Shrewd.
eo: Sagaca.

source: A man too shrewd for them⁠—or one of the things itself, an alien insect from beyond.
eo: Viro tro sagaca por ili⁠—aŭ unu de la aferaĉoj ilin mem, eksterterana insekto el preter.

source: The bus halted.
eo: La buso haltis.

source: An elderly man got on slowly and dropped his token into the box.
eo: Maljuna viro eniris malrapide kaj faligis sian ĵetonon en la skatolo.

source: He moved down the aisle and took a seat opposite Loyce.
eo: Li moviĝis laŭ la koridoro kaj prenis sidejon kontraŭ Lojso.

source: The elderly man caught the sharp-eyed man’s gaze.
eo: La maljuna viro allogis la rigardon de la akra okula viro.

source: For a split second something passed between them.
eo: Dum splita sekundo, io pasiĝis inter ilin.

source: A look rich with meaning.
eo: Rigardo riĉa kun signifo.

source: Loyce got to his feet.
eo: Lojso iĝis sur lian piedojn.

source: The bus was moving.
eo: La buso estis movanta.

source: He ran to the door.
eo: Li kuris al la pordo.

source: One step down into the well.
eo: Unu paŝo malsupre en la ŝakton.

source: He yanked the emergency door release.
eo: Li ektiregis la krize porda liberigo.

source: The rubber door swung open.
eo: La kaŭĉuka pordo svingiĝis malferme.

source: “Hey!” the driver shouted, jamming on the brakes.
eo: “Ho!” la ŝoforo kriegis, frapeganta sur la bremsojn.

source: “What the hell⁠—”
eo: “Kio diable⁠—”

source: Loyce squirmed through.
eo: Lojso tordiĝadis tra.

source: The bus was slowing down.
eo: La buso estis malrapidanta.

source: Houses on all sides.
eo: Domoj ĉe ĉiu flankoj.

source: A residential district, lawns and tall apartment buildings.
eo: Loĝeja distrikto, gazonoj kaj altaj apartamentaroj.

source: Behind him, the bright-eyed man had leaped up.
eo: Malantaŭ lin, la brila okula viro estis saltinta supre.

source: The elderly man was also on his feet.
eo: La maljunulo ankaŭ estis sur lia piedoj.

source: They were coming after him.
eo: Ili estis sekvanta li.

source: Loyce leaped.
eo: Lojso saltis.

source: He hit the pavement with terrific force and rolled against the curb.
eo: Li ekfalis al la pavimo kun ega forto kaj rulis kontraŭ la trotuarrando.

source: Pain lapped over him.
eo: Doloro plaŭdis sur lin.

source: Pain and a vast tide of blackness.
eo: Doloro kaj vasta tajdo de nigreco.

source: Desperately, he fought it off.
eo: Malespere, li el batis ĝin.

source: He struggled to his knees and then slid down again.
eo: Li luktis al sia genuoj kaj tiam glitis malsupre denove.

source: The bus had stopped.
eo: La buso estis haltinta.

source: People were getting off.
eo: Homo estis eliranta.

source: Loyce groped around.
eo: Lojso palpis cirkaŭe.

source: His fingers closed over something.
eo: Lia fingroj fermis super io.

source: A rock, lying in the gutter.
eo: Ŝtono, kuŝanta en la kanaleto.

source: He crawled to his feet, grunting with pain.
eo: Li rampis al sia piedoj, gruntanta per doloro.

source: A shape loomed before him.
eo: Formo elstaris supre antaŭ li.

source: A man, the bright-eyed man with the book.
eo: Viro, la brila okula viro kun la libro.

source: Loyce kicked.
eo: Lojso piedbatis.

source: The man gasped and fell.
eo: La viro anehelis kaj falis.

source: Loyce brought the rock down.
eo: Lojso batis malsupren per la rokon.

source: The man screamed and tried to roll away.
eo: La viro kriegis kaj povis ruliĝi for.

source: “Stop! For God’s sake listen⁠—”
eo: “Ĉesu! Por Dio, aŭskultu⁠—”

source: He struck again.
eo: Li batis denove.

source: A hideous crunching sound.
eo: Malbelega krakanta sono.

source: The man’s voice cut off and dissolved in a bubbling wail.
eo: La voĉo de la viro fortranĉiĝis kaj dissolvi en vezikanta lamento.

source: Loyce scrambled up and back.
eo: Lojso baraktis supren kaj malantaŭen.

source: The others were there, now.
eo: La aliaj estis tie, nun.

source: All around him.
eo: Tute cirkaŭ lin.

source: He ran, awkwardly, down the sidewalk, up a driveway.
eo: Li kuris, mallerte, laŭ la trotuaro, laŭ supre enveturejo.

source: None of them followed him.
eo: Neniu de ili sekvis lin.

source: They had stopped and were bending over the inert body of the man with the book, the bright-eyed man who had come after him.
eo: Ili estis ĉesinta kaj estis kliniĝanta super la interta korpo de la viro kun la libro, li brila okula viro kiu sekvis lin.

source: Had he made a mistake?
eo: Ĉu li eraris?

source: But it was too late to worry about that.
eo: Sed estis tro malfrue por zorgi pri tio.

source: He had to get out⁠—away from them.
eo: Li devis eliru⁠—for de ili.

source: Out of Pikeville, beyond the crack of darkness, the rent between their world and his.
eo: Ekster de Pikurbeto, preter la krako de mallumo, la ŝiraĵo inter ilia mondo kaj lia.

source: “Ed!” Janet Loyce backed away nervously.
eo: “Edo!” Janeto Lojso retroiris nervoze.

source: “What is it?
eo: “Kio estas ĝi?

source: What⁠—”
eo: Kio⁠—”

source: Ed Loyce slammed the door behind him and came into the living room.
eo: Edo Lojso fermis brue la pordon malantaŭ sin kaj alvenis la salonon.

source: “Pull down the shades.
eo: “Malsuprigu la rulkurtenojn.

source: Quick.”
eo: Rapide.”

source: Janet moved toward the window.
eo: Janeto proksimiĝis la fenestron.

source: “But⁠—”
eo: “Sed⁠—”

source: “Do as I say.
eo: “Faru kiel mi diras.

source: Who else is here besides you?”
eo: Kiu alia estas ĉi tie krom vi?”

source: “Nobody.
eo: “Neniu.

source: Just the twins.
eo: Nur la gemaloj.

source: They’re upstairs in their room.
eo: Ili estas supre la ŝtuparon en ilia dormĉambro.

source: What’s happened?
eo: Kio okazis?

source: You look so strange.
eo: Vi aspektas tiel strange.

source: Why are you home?”
eo: Kial vi estas hejme?”

source: Ed locked the front door.
eo: Edo ŝlosis la antaŭ pordo.

source: He prowled around the house, into the kitchen.
eo: Li ŝtelvagis cirkaŭe la domo, en la kuirejon.

source: From the drawer under the sink he slid out the big butcher knife and ran his finger along it.
eo: De la tirkesto sub la lavujo li glitigis la grandan viandistan tranĉilon kaj glitiigis sian fingron laŭ ĝi.

source: Sharp.
eo: Akra.

source: Plenty sharp.
eo: Sufiĉe akra.

source: He returned to the living room.
eo: Li revenis al la salonon.

source: “Listen to me,” he said.
eo: “Aŭskultu min,” li diris.

source: “I don’t have much time.
eo: “Mi ne havas multe da tempo.

source: They know I escaped and they’ll be looking for me.”
eo: Ili scias, ke mi eskapis kaj ili serĉos min.”

source: “Escaped?” Janet’s face twisted with bewilderment and fear.
eo: “Eskapis?” La vizaĝo de Janeto tordiĝis pro konfuzo kaj timo.

source: “Who?”
eo: “Kiu?”

source: “The town has been taken over.
eo: “La urbeto estas povprenita.

source: They’re in control.
eo: Ili estas en kontrolo.

source: I’ve got it pretty well figured out.
eo: Mi havas ĝin sufiĉe kompeninta.

source: They started at the top, at the City Hall and police department.
eo: Ili komencis ĉe la supro, ĉe urbodomo kaj policejo.

source: What they did with the real humans they⁠—”
eo: Kio ili faris al la reala homoj, ili⁠—”

source: “What are you talking about?”
eo: Pri kio vi parolas?

source: “We’ve been invaded.
eo: “Ni estis invaditaj.

source: From some other universe, some other dimension.
eo: El iu alia universo, iu alia dimensio.

source: They’re insects.
eo: Ili estas insekoj.

source: Mimicry.
eo: Mimeco.

source: And more.
eo: Kaj pli.

source: Power to control minds.
eo: Potenco por regi mensojn.

source: Your mind.”
eo: Vian menson.”

source: “My mind?”
eo: Mian menson?

source: “Their entrance is here, in Pikeville.
eo: “Ilia enirejo estas ĉi tie, en Pikurbeto.

source: They’ve taken over all of you.
eo: Ili povpreninta ĉiu vin.

source: The whole town⁠—except me.
eo: La tuta urbeto⁠—krom mi.

source: We’re up against an incredibly powerful enemy, but they have their limitations.
eo: Ni estas kontraŭ nekredeble potenca malamiko, sed ili havas iliajn limecojn.

source: That’s our hope.
eo: Tio estas nia espero.

source: They’re limited!
eo: Ili estas limigitaj!

source: They can make mistakes!”
eo: Ili povas fari erarojn!”

source: Janet shook her head.
eo: Janeto kapneis.

source: “I don’t understand, Ed.
eo: “Mi ne komprenas. Edo.

source: You must be insane.”
eo: Vi ŝajnas certe freneza.”

source: “Insane?
eo: “Freneza?

source: No.
eo: Ne.

source: Just lucky.
eo: Nur bonŝanca.

source: If I hadn’t been down in the basement I’d be like all the rest of you.” Loyce peered out the window.
eo: Se mi ne estus malsupre en la kelo, mi estus kiel ĉiuj cetera vi.” Lojso vigle rigardis ekstere tra la fenestro.

source: “But I can’t stand here talking.
eo: “Sed mi ne povas stari ĉi tie parolante.

source: Get your coat.”
eo: Prenu vian mantelon.”

source: “My coat?”
eo: “Mian mantelon?”

source: “We’re getting out of here.
eo: “Ni eliros de ĉi tie.

source: Out of Pikeville.
eo: Eksteren de Pikurbeto.

source: We’ve got to get help.
eo: Ni devas akiri helpon.

source: Fight this thing.
eo: Batali ĉi tiu afero.

source: They can be beaten.
eo: Ili povas esti venkitaj.

source: They’re not infallible.
eo: Ili ne estas seneraraj.

source: It’s going to be close⁠—but we may make it if we hurry.
eo: Estos necerte⁠—sed ni eble sukcesos se ni rapidos.

source: Come on!” He grabbed her arm roughly.
eo: Venu!” Li ekprenis ŝian brakon malglate.

source: “Get your coat and call the twins.
eo: “Akiru vian mantelon kaj voku la gemalojn.

source: We’re all leaving.
eo: Ni ĉiuj foriros.

source: Don’t stop to pack.
eo: Ne haltu por paki.

source: There’s no time for that.”
eo: Estas neniom tempo por tio.”

source: White-faced, his wife moved toward the closet and got down her coat.
eo: Blanka vizaĵa, lia edzino aproksimiĝis la ŝranko kaj elprenis ŝian mantelon.

source: “Where are we going?”
eo: “Kien ni iros?”

source: Ed pulled open the desk drawer and spilled the contents out onto the floor.
eo: Li elprenis la skribotabla tirkesto kaj elverŝis la enhavon sur la planko.

source: He grabbed up a road map and spread it open.
eo: Li ekprenis supren voja mapon kaj disvastiĝis ĝin malferme.

source: “They’ll have the highway covered, of course.
eo: “Ili kovros la ŝoseon, kompreneble.

source: But there’s a back road.
eo: Sed estas malantau vojo.

source: To Oak Grove.
eo: Al Kverka Arbareto.

source: I got onto it once.
eo: Mi eniris ĝin unufoje.

source: It’s practically abandoned.
eo: Ĝi estas preskaŭ forlasita.

source: Maybe they’ll forget about it.”
eo: Eble ili forgesos pri ĝi.”

source: “The old Ranch Road?
eo: “La malnova Vojo de la Ranĉo?

source: Good Lord⁠—it’s completely closed.
eo: Bona Dio⁠—estas tute ferma.

source: Nobody’s supposed to drive over it.”
eo: Neniu rajtas stiri sur ĝi.”

source: “I know.” Ed thrust the map grimly into his coat.
eo: “Mi scias.” Edo forte metis la mapon malgaje en sia mantelo.

source: “That’s our best chance.
eo: “Tio estas nia ple bona ŝanco.

source: Now call down the twins and let’s get going.
eo: Nun voku al malsupren la gemaloj kaj ni ekiru.

source: Your car is full of gas, isn’t it?”
eo: Via aŭto estas plena de benzino, ĉu ne?”

source: Janet was dazed.
eo: Janeto estis stuporita.

source: “The Chevy?
eo: “La Ĉev-aŭto?

source: I had it filled up yesterday afternoon.” Janet moved toward the stairs.
eo: Mi plenigis ĝin hieraŭ posttagmezze.” Janeto movigis al la ŝtuparoj.

source: “Ed, I⁠—”
eo: “Edo, mi⁠—”

source: “Call the twins!” Ed unlocked the front door and peered out.
eo: “Voku la ĝemelojn!” Edo malŝlosis la antaŭan pordon kaj intense vidis ekstere.

source: Nothing stirred.
eo: Nenio moviĝis.

source: No sign of life.
eo: Neniu signo de vivo.

source: All right so far.
eo: Sufiĉe bone ĝis nun.

source: “Come on downstairs,” Janet called in a wavering voice.
eo: “Venu malsupren laŭ la ŝtuparon,” Janeto vokis en ŝanceliĝanta voĉo.

source: “We’re⁠—going out for awhile.”
eo: “Ni⁠—eliros dum iom da tempo.”

source: “Now?” Tommy’s voice came.
eo: “Nun?” La voĉo de Tomaso venis.

source: “Hurry up,” Ed barked.
eo: “Rapidu,” Edo bojis.
